loadtests/ask.yml
config:
  target: "http://localhost:8080"
  http:
    # Responses have to be sent within 60 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 30
  phases:
    - duration: 5
      arrivalRate: 5

scenarios:
  - flow:
      - post:
          url: "/ask"
          headers:
            Accept: "application/json, text/plain, */*"
            Authorization: "Bearer "
          json:
            messages:
              - message: "como fazer microagulhamento?"
                from:
                  User: {}
              - message: "só colocar as agulha"
                from:
                  Bot: {}
              - message: "q agulha?"
                from:
                  User: {}
            basedOnDocsOnly: true
            useActions: false